# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "asciiquarium"
brew "bash"
brew "bash-completion@2"
brew "cmatrix"
brew "curl"
#brew "dnsmasq", restart_service: true
brew "findutils"
brew "flake8"
brew "fzf"
brew "git"
brew "google-cloud-sdk"
brew "htop"
brew "jumpcut"
brew "newsboat"
brew "pandoc"
brew "powershell"
brew "python"
brew "rename"
brew "speedtest"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "youtube-dl"
brew "zsh"

# Apps
# Great USB Imager
cask "balenaetcher"
cask "caffeine"
cask "cyberduck"
# Database GUI
cask "dbeaver-community"
cask "docker"
cask "evernote"
# Best screen color changer (for day/night)
cask "flux"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "imagealpha"
cask "imageoptim"
# Animated Screen Capture
cask "licecap"
# Rename a list of files quickly
cask "namechanger"
# VPN Provider
cask "mullvadvpn"
# Podcatcher
cask "pocket-casts"
# QuickLook ColorCode for Finder
cask "qlcolorcode"
# QuickLook Image Size for Finder
cask "qlimagesize"
# QuickLook for Markdown files
cask "qlmarkdown"
# QuickLook for plaintext files
cask "qlstephen"
cask "sketch"
cask "slack"
cask "spotify"
#cask "steam"
cask "spectacle"
cask "the-unarchiver"
cask "transmission"
# VPN GUI for OpenVPN
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xscreensaver"





# https://github.com/kylegordy/Brewfile/blob/master/Brewfile
