# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "atombender/ktail"
# https://github.com/puppetlabs/homebrew-puppet
tap "puppetlabs/puppet"
tap "int128/kubelogin"

# Binaries
brew "asciiquarium"
brew "bash"
brew "bash-completion@2"
# Best cat/more/less formatter
brew "bat"
brew "cmatrix"
brew "curl"
#brew "dnsmasq", restart_service: true
brew "findutils"
brew "flake8"
brew "fzf"
brew "git"
# Similar to htop but more details
brew "glances"
brew "helm"
brew "helmfile"
brew "htop"
# https://github.com/atombender/ktail
brew "ktail" 
brew "kubernetes-cli"
brew "kubectx"
brew "kubelogin"
# See K8S resources in realtime 
brew "kubespy"
brew "maven"
brew "minikube"
brew "newsboat"
brew "pandoc"
brew "python"
brew "rename"
brew "speedtest-cli"
# Great tool to simulate loads 
brew "stress"
# For tunneling via SSH
brew "sshuttle"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "unnethack"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
# Great USB Imager
cask "balenaetcher"
cask "caffeine"
# Ebook Organizer
cask "calibre"
cask "cyberduck"
# Database GUI
cask "dbeaver-community"
cask "docker"
cask "evernote"
cask "firefox"
# Best screen color changer (for day/night)
cask "flux"
# Excellent Git GUI
cask "fork"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "imagealpha"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
# Great copy and paste management tool
cask "jumpcut"
cask "keybase"
# https://github.com/lensapp/lens
cask "lens"
# Animated Screen Capture
cask "licecap"
# Graphical Diff
cask "meld"
# Rename a list of files quickly
cask "namechanger"
# VPN Provider
cask "mullvadvpn"
# Opensource Broadcast Software
cask "obs"
# https://github.com/puppetlabs/pdk
# Puppet Client Tools
cask "pe-client-tools"
# Puppet Development Kit
cask "pdk"
cask "plex"
# Music player for Plex
cask "plexamp"
# Podcatcher
cask "pocket-casts"
# Graphical REST Tool
cask "postman"
cask "powershell"
# SMS across devices
cask "pulse-sms"
# QuickLook ColorCode for Finder
cask "qlcolorcode"
# QuickLook Image Size for Finder
cask "qlimagesize"
# QuickLook for Markdown files
cask "qlmarkdown"
# QuickLook for plaintext files
cask "qlstephen"
# Secure Chat
cask "signal"
cask "sketch"
cask "slack"
cask "spectacle"
cask "spotify"
#cask "steam"
cask "the-unarchiver"
cask "transmission"
# VPN GUI for OpenVPN
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xscreensaver"





# https://github.com/kylegordy/Brewfile/blob/master/Brewfile
