# Taps
tap "atombender/ktail"
tap "chef/chef"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "int128/kubelogin"
# https://www.hashicorp.com/blog/announcing-hashicorp-homebrew-tap
tap "hashicorp/tap"
# https://github.com/puppetlabs/homebrew-puppet
tap "puppetlabs/puppet"
tap "int128/kubelogin"
tap "derailed/k9s"
tap "chef/chef"
tap "benwebber/tunnelblickctl"

# Binaries
brew "ansible"
brew "ansible-lint"
brew "asciiquarium"
# Tool version Manager used for Elixir http://asdf-vm.com/guide/introduction.html#how-it-works
brew "asdf"
brew "awscli"
brew "aws-cdk"
brew "bash"
brew "bash-completion@2"
# Best cat/more/less formatter
brew "bat"
# Cloud Formation Linter
brew "cfn-lint"
# CloudFlare SSL (ie openssl cli replacement)
brew "cfssl"
brew "cmatrix"
# Commitizen tui for conventional commits https://github.com/commitizen/cz-cli
# Probably prefer npm install -g commitizen because brew is very old 2.x vs 4.x
# git cz can be installed via npm install -g git-cz
#brew "commitizen"
brew "consul"
brew "consul-template"
# For things like realpath
brew "coreutils"
brew "curl"
#brew "elixir"
#brew "dnsmasq", restart_service: true
# https://github.com/goodwithtech/dockle
# Contianer Image Linter
brew "goodwithtech/r/dockle"
# Golang linter
brew "golangci-lint"
brew "docker-compose"
# Practice your coding via exercism.io
brew "exercism"
brew "findutils"
brew "flake8"
brew "fluxctl"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
# Similar to htop but more details
brew "glances"
brew "helm"
brew "helmfile"
brew "htop"
brew "jq"
# Interactive json cli too https://pauljuliusmartinez.github.io/?ref=console.dev
brew "jless"
# Artifactory CLI
brew "jfrog-cli"
# https://github.com/atombender/ktail
brew "ktail" 
brew "k9s" 
brew "kubernetes-cli"
brew "kubectx"
brew "kubelogin"
# See K8S resources in realtime 
brew "kubespy"
# For heif-convert cli tool
brew "libheif"
brew "maven"
brew "make"
brew "minikube"
# Like Charlesproxy but opensource https://mitmproxy.org
brew "mitmproxy"
brew "mplayer"
brew "newsboat"
brew "npm"
# https://github.com/vmware-tanzu/octant
# Shows how applications run on k8s
brew "octant"
brew "pandoc"
brew "packer"
brew "pdf2svg"
# GUI Postgres Client (like dbeaver but lighter)
brew "postico"
brew "python"
brew "pyenv-virtualenv"
brew "rename"
brew "rust"
# https://github.com/mozilla/sops manages secrets for helmfile
brew "sops"
brew "speedtest-cli"
brew "sqlite"
# For tunneling via SSH
brew "sshuttle"
# Great tool to simulate loads 
brew "stress"
brew "termshark"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
# License not opensource?
#brew "unrar"
brew "unnethack"
brew "wireshark"
brew "vim"
# Versatile HTTP load tester 
brew "vegeta"
brew "watch"
brew "wget"
brew "yamllint"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
# Removes everything on uninstall of an app
cask "apptrap"
# Great USB Imager
cask "balenaetcher"
# Don't let the mac fall asleep (clickable)
cask "caffeine"
cask "chef/chef/inspec"
# Ebook Organizer
cask "calibre"
cask "cyberduck"
# Database GUI
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "evernote"
cask "firefox"
# Best screen color changer (for day/night)
cask "flux"
# Excellent Git GUI
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
#cask "imagealpha"
#cask "imageoptim"
cask "inkscape"
cask "istat-menus"
cask "iterm2"
# Great copy and paste management tool
cask "jumpcut"
# The best encrypted chat
cask "keybase"
# K8S GUI https://github.com/lensapp/lens
cask "lens"
# Animated Screen Capture
cask "licecap"
# Graphical Diff
cask "meld"
# Autodesk meshmixer used to separate polygons for multicolor MMU prints
#cask "meshmixer"
# Rename a list of files quickly
cask "namechanger"
# VPN Provider
#cask "mullvadvpn"
# Opensource Broadcast Software
cask "obs"
# https://github.com/puppetlabs/pdk
# Puppet Client Tools
#cask "pe-client-tools"
# Puppet Development Kit
#cask "pdk"
cask "plex"
# Music player for Plex
cask "plexamp"
# Podcatcher
cask "pocket-casts"
# Graphical REST Tool
cask "postman"
cask "powershell"
# SMS across devices
cask "pulse-sms"
# Replaced spectacle
cask "rectangle"
# Secure Chat
cask "signal"
cask "spotify"
cask "the-unarchiver"
cask "thunderbird"
#cask "transmission"
# VPN GUI for OpenVPN
#cask "tunnelblick"
#cask "tunnelblickctl"
cask "vagrant"
cask "virtualbox"
# Open source version of Visual Studio Code
#cask "vscodium"
cask "visual-studio-code"
cask "vlc"
# This includes the GUI
cask "wireshark"
cask "xscreensaver"

# Need to write a commercial/closed source/optional Brewfile?
# Great Design tool
#cask "sketch"

# https://github.com/kylegordy/Brewfile/blob/master/Brewfile
